Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/mems.tmx
Source language: ca
Languages: es_es

source: Podeu veure una representació gràfica de tot el procés en les taules a : s'hi mostra en negretes l'element consultat en cada moment i ombrejada la part de la llista descartada.
es_es: Podéis ver una representación gráfica de todo el proceso en las tablas a : se muestra en negrita el elemento consultado en cada momento y sombreada la parte de la lista descartada.

source: Preedició i postedició
es_es: Preedición y postedición

source: Pràcticament ningú va considerar com es podria traure profit d'un sistema imperfecte: per què pensar-hi si aviat es disposaria de sistemes perfectes?
es_es: Prácticamente nadie consideró cómo se podría sacar provecho de un sistema imperfecto: ¿por qué pensar en ello si pronto se dispondría de sistemas perfectos?

source: Quan creem una nova base de dades i definim l'estructura de camps que tindrà cada un dels seus registres, podem designar quins dels camps corresponen als índexs; el gestor de la base de dades crearà automàticament els índexs corresponents.
es_es: Cuando creamos una nueva base de datos y definimos la estructura de campos que tendrá cada uno de sus registros, podemos designar cuáles de los campos corresponden a los índices; el gestor de la base de datos creará automáticamente los índices correspondientes.

source: Quan els programes de traducció automàtica i semiautomàtica han de tractar documents estructurats (com els discutits en els epígrafs i ) han de ser capaços d'identificar les parts dels documents que corresponen als textos que s'han de traduir, destriant-les de les etiquetes.
es_es: Cuando los programas de traducción automática y semiautomática tienen que tratar documentos estructurados (como los discutidos en los epígrafes y ) tienen que ser capaces de identificar las partes de los documentos que corresponden a los textos que se tienen que traducir, distinguiéndolas de las etiquetas.

source: Quan es vol usar un sistema de traducció automàtica per a l'assimilació d'informació, a què donaríeu menys pes en l'avaluació?
es_es: Cuando se quiere usar un sistema de traducción automática para la asimilación de información, ¿a qué daríais menos peso en la evaluación?

source: Quan la traducció automàtica s'usa per a la disseminació de documents tècnics de temàtica homogènia, pot ser interessant fer que els documents originals estiguen escrits usant un lèxic estàndard sense ambigüitats semàn­ti­ques i seguint unes regles sintàctiques i d'estil ben determinades, és a dir, en un llenguatge controlat {wojcik96u,arnold94b} dissenyat de manera que el resultat de la traducció automàtica puga ser usat directament per a publicar-lo amb el mínim possible de postedició.
es_es: Cuando la traducción automática se usa para la diseminación de documentos técnicos de temática homogénea, puede ser interesante hacer que los documentos originales estén escritos usando un léxico estándar sin ambigüedades semánticas y siguiendo unas reglas sintácticas y de estilo muy determinadas, es decir, en un lenguaje controlado {wojcik96u,arnold94b} diseñado de forma que el resultado de la traducción automática pueda ser usado directamente para publicarlo con la postedición mínima posible .

source: Quan volem buscar una determinada informació en un fitxer de fitxes de cartolina (per exemple, quins autors han usat el mot arbre en el títol de les seues obres), i aquest fitxer no està ordenat d'acord amb cap criteri convenient, ens veurem obligats a mirar totes les fitxes una per una.
es_es: Cuando queremos buscar una determinada información en un fichero de fichas de cartulina (por ejemplo, qué autores han usado la palabra árbol en el título de sus obras), y este fichero no está ordenado de acuerdo con ningún criterio conveniente, nos veremos obligados a mirar todas las fichas una por una.

source: Quin dels següents no és un avantatge dels llenguatges controlats?
es_es: ¿Cuál de los siguientes no es una ventaja de los lenguajes controlados?

source: Què tenen en comú tots els camps d'una fitxa terminològica?
es_es: ¿Qué tienen en común todos los campos de una ficha terminológica?

source: Què és la traducció?
es_es: ¿Qué es la traducción?

source: Què és una base de dades?
es_es: ¿Qué es una base de datos?

source: Qüestions i exercicis
es_es: Cuestiones y ejercicios

source: Qüestions, exercicis i problemes
es_es: Cuestiones, ejercicios y problemas

source: S'han de construir dos índexs, un per a cada camp.
es_es: Se tienen que construir dos índices, uno para cada campo.

source: SALT 3.0 tradueix textos de l'espanyol a la varietat valenciana del català i pregunta esporàdicament a la persona usuària quin equivalent és més adequat per a alguns mots ambigus difícils.
es_es: SALT 3.0 traduce textos del español a la variedad valenciana del catalán y pregunta esporádicamente a la persona usuaria qué equivalente es más adecuado para algunas palabras ambiguas difíciles.

source: SALT tradueix textos (ANSI, RTF o documents de Microsoft Word) en espanyol a la variant valenciana del català ---l'estàndard lingüístic dels textos meta es pot regular usant un menú molt senzill--- o corregeix una bona part de les errades típiques dels textos valencians.
es_es: SALT traduce textos (ANSI, RTF o documentos de Microsoft Word) en español a la variante valenciana del catalán ---el estándar lingüístico de los textos meta se puede regular usando un menú muy sencillo--- o corrige una buena parte de los errores típicos de los textos valencianos.

source: SALT, de la Generalitat Valenciana
es_es: Historia de la traducción automática

source: Se solia menjar la gent, i una vegada, la gent va anar i va dir al seu gran home, al seu cap, va anar i van parlar amb ell.
es_es: Se solía comer la gente, y una vez, la gente fue y dijo a su gran hombre, a su cabeza, fue y hablaron con él.

source: Si busquem en una base de dades de 240 fitxes d'alumnes una fitxa (un registre) pel número de telèfon, un camp pel qual no està ordenada, quantes consultes haurà de fer, com a màxim, el programa gestor de la base de dades fins arribar a la fitxa desitjada?
es_es: Si buscamos en una base de datos de 240 fichas de alumnas una ficha (un registro) por el número de teléfono, un campo por el que no está ordenada, ¿cuántas consultas tendrá que hacer, como máximo, el programa gestor de la base de datos hasta llegar a la ficha deseada?

source: Si busquem una alumna pel NIF, quantes consultes fa, com a màxim, el programa gestor de la base de dades fins arribar a la fitxa desitjada?
es_es: Si buscamos una alumna por el NIF, ¿cuántas consultas hace, como máximo, el programa gestor de la base de datos hasta llegar a la ficha deseada?

source: Si enviem un document HTML a un servidor de traducció automàtica i després posteditem el resultat perquè siga una traducció acceptable de l'original abans de publicar-la, estem usant la traducció automàtica{}
es_es: Si enviamos un documento HTML a un servidor de traducción automática y después posteditamos el resultado para que sea una traducción aceptable del original antes de publicarla, estamos usando la traducción automática{}

source: Si la consulta o la recerca que volem fer es refereix al camp pel qual s'ha establit l'ordenació, és molt més senzilla que si es refereix a un altre camp, i es pot completar sense mirar totes les fitxes; per exemple, fent-hi una recerca dicotòmica.
es_es: Si la consulta o la búsqueda que queremos hacer se refiere al campo por el cual se ha establecido la ordenación, es mucho más sencilla que si se refiere a otro campo, y se puede completar sin mirar todas las fichas; por ejemplo, haciendo una búsqueda dicotómica.

source: Si la recerca haguera estat de l'element ``González'', els passos anteriors haurien estat els mateixos, però a més hauríem mirat l'element 11, l'element 10 i, finalment, hauríem conclòs que l'element no es troba a la llista.
es_es: Si la investigación hubiera sido del elemento ``González'', los pasos anteriores habrían sido los mismos, pero además habríamos mirado el elemento 11, el elemento 10 y, finalmente, habríamos llegado a la conclusión de que el elemento no se encuentra en la lista.

source: Si la traducció es fa mitjançant un sistema automàtic, quin ús n'està fent?
es_es: Si la traducción se hace mediante un sistema automático, ¿qué uso está haciendo?

source: Si les consultes més freqüents es refereixen a un camp que pren valors que es poden ordenar, els registres es poden ordenar per aquest camp, igual que el fitxer de fitxes de cartolina.
es_es: Si las consultas más frecuentes se refieren a un campo que toma valores que se pueden ordenar, los registros se pueden ordenar por este campo, igual que el fichero de fichas de cartulina.

source: Si penseu en el cas que la base de dades de la taula tingués, diguem-ne, 20 camps més (amb els equivalents en 20 llengües més), us podeu fer una idea de l'estalvi que s'aconsegueix respecte a la duplicació sencera.
es_es: Si pensáis en el supuesto de que la base de datos de la tabla tuviera, digamos, 20 campos más (con los equivalentes en 20 lenguas más), os podéis hacer una idea del ahorro que se consigue respecto a la duplicación entera.

source: Si un angloparlant usa el traductor automàtic portugués--anglés de |babelfish.altavista.com| per a llegir en línia el diari brasileny O Globo, està usant la traducció automàtica per a un propòsit
es_es: Si un angloparlante usa el traductor automático portugués--inglés de |babelfish.altavista.com| para leer en línea el diario brasileny O Globo, está usando la traducción automática para un propósito

source: Si volem facilitar les consultes associades a més d'un camp (per exemple, autors i matèries) ens veurem obligats a mantenir dues còpies del fitxer sencer, cada còpia ordenada per un criteri; com veurem tot seguit, amb un sistema de bases de dades no cal fer aquesta duplicació.
es_es: Si queremos facilitar las consultas asociadas a más de un campo (por ejemplo, autores y materias) nos veremos obligados a mantener dos copias del fichero entero, cada copia ordenada por un criterio; como veremos a continuación, con un sistema de bases de datos no hay que hacer esta duplicación.

source: Si volem fer consultes ràpides pels camps ``BASC'' i ``SERBO-CROAT'' sense haver de visitar (en el cas pitjor) tots els registres, el gestor de bases de dades ha de definir un índex per a cada un d'aquests camps com els de les taules ; hi podeu comprovar com cada fitxa de l'índex conté només el camp indexat i una referència a la seua posició en la base de dades.
es_es: Si queremos hacer consultas rápidas por los campos ``VASCO'' y ``SERBIO-CROATA'' sin tener que visitar (en el peor caso) todos los registros, el gestor de bases de datos tiene que definir un índice para cada uno de estos campos como los de las tablas ; podéis comprobar cómo cada ficha del índice contiene sólo el campo indexado y una referencia a su posición en la base de datos.

source: Sis dels 8 subprogrames es generen automàticament a partir de les dades lingüístiques corresponents, mitjançant ferramentes informàtiques desevolupades en el projecte; els altres dos mòduls (el primer i l'últim de la cadena de muntatge) s'encarreguen, el primer (desformatador), de separar els codis de format HTML o RTF del text, i l'últim (reformatador), de tornar a combinar-los per tal que la traducció conserve el format del text origen.
es_es: Seis de los 8 subprogramas se generan automáticamente a partir de los datos lingüísticos correspondientes, mediante herramientas informáticas desarrolladas en el proyecto; los otros dos módulos (el primero y el último de la cadena de montaje) se encargan, el primero (desformateador), de separar los códigos de formato HTML o RTF del texto, y el último (reformateador), de volver a combinarlos para que la traducción conserve el formato del texto origen.

source: Sobre la relació entre traducció humana i traducció automàtica, vegeu la secció .
es_es: Sobre la relación entre traducción humana y traducción automática, véase la sección .

source: Solucions
es_es: Soluciones

source: Són especialment importants els resultats obtinguts a diverses empreses com Xerox on s'elimina quasi completament la postedició (vegeu la p. ) gràcies al control de la llengua origen; això permet la traducció senzilla dels manuals tècnics en anglés de la companyia a un gran nombre d'idiomes (francés, alemany, italià, espanyol, portugués i llengues escandinaves).
es_es: Son especialmente importantes los resultados obtenidos en varias empresas como Xerox, donde se elimina casi completamente la postedición (véase la p. ) gracias al control de la lengua origen; esto permite la traducción sencilla de los manuales técnicos en inglés de la compañía a un gran número de idiomas (francés, alemán, italiano, español, portugués y lenguas escandinavas).

source: També el 1976 apareix Metéo, desenvolupat per la Universitat de Montréal, que tradueix al francés els informes meteorològics.
es_es: También en 1976 aparece Metéo, desarrollado por la Universidad de Montréal, que traduce al francés los informes meteorológicos.

source: També hi ha disponible una versió per a servidors basats en el sistema operatiu Windows.
es_es: También hay disponible una versión para servidores basados en el sistema operativo Windows.

source: Tenim una base de dades amb fitxes de 100 alumnes ordenada pel NIF.
es_es: Tenemos una base de datos con fichas de 100 alumnas ordenada por el NIF.

source: Tornem a repetir el procés, aquesta vegada considerant només la subllista d'elements entre el 7 i el 12; tenim sort i en mirar l'element central (el 9) ens adonem que coincideix amb l'element buscat: la recerca, doncs, acaba amb èxit.
es_es: Volvemos a repetir el proceso, esta vez considerando sólo la sublista de elementos entre el 7 y el 12; tenemos suerte y al mirar el elemento central (el 9) nos damos cuenta de que coincide con el elemento buscado: la búsqueda, pues, acaba con éxito.

source: Tot i això, alguns grups van continuar treballant a Canadà i a Europa i van aparéixer els primers sistemes que funcionaven; el 1970 el sistema Systran va començar a ser usat per la USAF (United States Air Force) i el 1976 per la Comissió de la Comunitat Europea.
es_es: Aún así, algunos grupos continuaron trabajando en Canadá y en Europa y aparecieron los primeros sistemas que funcionaban; en 1970 el sistema Systran empezó a ser usado por la USAF (United States Air Force) y en 1976 por la Comisión de la Comunidad Europea.

source: Tot i que els resultats no eren massa bons, el públic i la indústria van creure que en uns anys es podrien aconseguir traduccions automàtiques de qualitat de documents científics i tècnics.
es_es: A pesar de que los resultados no eran demasiados buenos, el público y la industria creyeron que en unos años se podrían conseguir traducciones automáticas de calidad de documentos científicos y técnicos.

source: Tot i que en els decennis dels 1930 i 1940 hi va haver alguns treballs precursors, és als primers cinquanta quan comença realment la recerca en TA en moltes universitats arreu al món, especialment als Estats Units.
es_es: A pesar de que en los años 1930 y 1940 hubo algunos trabajos precursores, es a comienzos de los cincuenta cuando empieza realmente la investigación en TA en muchas universidades por todas partes del mundo, especialmente en los Estados Unidos.

source: Tot i que la duplicació d'una base de dades menuda pot no semblar en principi problemàtica, les coses canvien si considerem una base de dades amb milers de registres i amb un gran nombre de camps, tots plens d'informació.
es_es: A pesar de que la duplicación de una base de datos pequeña puede no parecer problemática en principio, las cosas cambian si consideramos una base de datos con miles de registros y con un gran número de campos, todos llenos de información.

source: Tot i que la gran innovació dels noranta van ser els mètodes descrits abans, la recerca i el desenvolupament dels sistemes clàssics també va continuar: per exemple, el projecte Eurolang basat en el sistema de transferència Metal pot traduir de l'anglès al francés, alemany, italià i espanyol, i viceversa.
es_es: A pesar de que la gran innovación de los noventa fueron los métodos descritos anteriormente, la investigación y el desarrollo de los sistemas clásicos también continuó: por ejemplo, el proyecto Eurolang basado en el sistema de transferencia Metal puede traducir del inglés al francés, alemán, italiano y español, y viceversa.

source: Tot i que la traducció resultant tenia bastanta qualitat, necessitava una gran quantitat de postedició.
es_es: A pesar de que la traducción resultante tenía bastante calidad, necesitaba una gran cantidad de postedición.

source: Tothom accepta ja en aquest decenni la importància dels llenguatges controlats i els subllenguatges en la TA, com ja havien defensat els precursors de la TA durant el decenni dels cinquanta.
es_es: Todo el mundo acepta ya en esta década la importancia de los lenguajes controlados y los sublenguajes en la TA, como ya habían defendido los precursores de la TA durante los cincuenta.

source: Tots els sistemes de TA dels vuitanta, tant els de transferència com els d'interlingua, funcionen bàsicament a partir de regles lingüístiques.
es_es: Todos los sistemas de TA de los ochenta, tanto los de transferencia como los de interlingua, funcionan básicamente a partir de reglas lingüísticas.

source: Traducció automàtica
es_es: Traducción automática

source: Traducció automàtica assistida per la persona Traducció humana assistida per la màquina Usa un llenguatge controlat
es_es: Traducción automática asistida por la persona Traducción humana asistida por la máquina Usa un lenguaje controlado

source: Traducció i traducció automàtica
es_es: Traducción y traducción automática

source: Un llenguatge controlat és ``un subconjunt del llenguatge natural definit amb precisió, d'una banda restringit quant al lèxic, a la gramàtica i a l'estil, i d'una altra, possiblement estés amb terminologia i construccions gramaticals específiques d'un domini'' {huijsen98u}.
es_es: Un lenguaje controlado es ``un subconjunto del lenguaje natural definido con precisión, por un lado restringido en cuanto al léxico, a la gramática y al estilo, y por otro, posiblemente extendido con terminología y construcciones gramaticales específicas de un dominio'' {huijsen98u}.

source: Un aclariment és necessari sobre el tractament dels textos informatitzats.
es_es: Es necesaria una aclaración sobre el tratamiento de los textos informatizados.

source: Un altre exemple clàssic de llenguatge controlat és PACE ({ Perkins-approved controlled English}), l'anglés controlat usat per la companyia de motors Diesel Perkins, concebut especialment per a facilitar la traducció automàtica dels manuals que descriuen les característiques i el manteniment d'aquests motors {newton92b}.
es_es: Otro ejemplo clásico de lenguaje controlado es PACE ({ Perkins-approved controlled English}), el inglés controlado usado por la compañía de motores Diesel Perkins, concebido especialmente para facilitar la traducción automática de los manuales que describen las características y el mantenimiento de estos motores {newton92b}.

source: Un decenni després, i com que les expectatives eren tan altes, els avanços eren escassos i el futur pròxim no semblava poder millorar la situació.
es_es: Una década más tarde, y ya que las expectativas eran tan altas, los avances eran escasos y el futuro próximo no parecía poder mejorar la situación.

source: Un dels programes més comunament usats pels professionals de la traducció són els gestors de bases de dades lèxiques (normalment anomenats gestors de bases de dades terminològiques, encara que es poden usar per a moltes altres aplicacions a més de les estrictament terminològiques).
es_es: Uno de los programas más comúnmente usados por los profesionales de la traducción son los gestores de bases de datos léxicas (normalmente llamados gestores de bases de datos terminológicas, aunque se pueden usar para otras muchas aplicaciones además de las estrictamente terminológicas).

source: Un equip d'investigadors de la Universitat d'Alacant, finançat per la Caja de Ahorros del Mediterràneo i la mateixa Universitat, està desenvolupant actualment sota la direcció d'un dels autors d'aquest llibre un sistema de traducció automàtica espanyol--català anomenat interNOSTRUM {canals01a,canals01b}.
es_es: Un equipo de investigadores de la Universidad de Alicante, financiado por la Caja de Ahorros del Mediterráneo y la misma Universidad, está desarrollando actualmente bajo la dirección de uno de los autores de este libro un sistema de traducción automática español--catalán llamado interNOSTRUM {canales01a,canales01b}.

source: Un exemple de llenguatge controlat és l'anglés simplificat ({ Simplified English}) de l'AECMA (Associació Europea d'Indústries Aeroespacials), que es caracteritza per ``una sintaxi senzilla, un nombre limitat de mots, un nombre limitat de significats ben definits per mot (normalment un), i un nombre limitat de categories lèxiques) són conjunts de mots que tenen la mateixa funció sintàctica; hi ha categories majors, lèxiques o de classe oberta (substantiu, adjectiu, verb, etc.) que creixen quan s'afig nou lèxic a la llengua i categories menors, { gramaticals} o de classe tancada (articles, conjuncions, etc.), que no creixen i contenen mots amb funció gramatical.
es_es: Un ejemplo de lenguaje controlado es el inglés simplificado ({ Simplified English}) de la AECMA (Asociación Europea de Industrias Aeroespaciales), que se caracteriza por ``una sintaxis sencilla, un número limitado de palabras, un número limitado de significados muy definidos por palabra (normalmente uno), y un número limitado de categorías léxicas) son conjuntos de palabras que tienen la misma función sintáctica; hay categorías mayores, léxicas o de clase abierta (sustantivo, adjetivo, verbo, etc.) que crecen cuando se añade nuevo léxico a la lengua y categorías menores, { gramaticales} o de clase cerrada (artículos, conjunciones, etc.), que no crecen y contienen palabras con función gramatical.

source: Un exemple n'és TAUM Méteo, el sistema que produeix informes meteorològics simultanis en francés i en anglés al Canadà des de fa més de vint anys.
es_es: Un ejemplo es TAUM Méteo, el sistema que produce informes meteorológicos simultáneos en francés y en inglés en Canadá desde hace más de veinte años.

source: Un llenguatge controlat té sovint associat un conjunt de programes de suport que ajuden a avaluar i escriure documents que en complisquen les restriccions.
es_es: Un lenguaje controlado tiene a menudo asociado un conjunto de programas de apoyo que ayudan a evaluar y escribir documentos que cumplan las restricciones.

source: Un programa similar (i, segons les nostres notícies, d'origen comú) a l'usat per El Periódico de Catalunya s'anomena AutomaticTrans i es pot provar (sobre textos de 50 paraules) en Internet.}
es_es: Un programa similar (y, según nuestras noticias, de origen común) al usado por El Periódico de Cataluña se denomina AutomaticTrans y se puede probar (sobre textos de 50 palabras) en Internet.}

source: Un sistema que suggereix millores a l'estil d'un document es pot considerar com {}
es_es: Un sistema que sugiere mejoras al estilo de un documento se puede considerar cómo {}
